OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1579.h
extern __at(0x0DC1) __sfr PWM4PHL;

typedef struct
  {
  unsigned PWM4PHL0             : 1;
  unsigned PWM4PHL1             : 1;
  unsigned PWM4PHL2             : 1;
  unsigned PWM4PHL3             : 1;
  unsigned PWM4PHL4             : 1;
  unsigned PWM4PHL5             : 1;
  unsigned PWM4PHL6             : 1;
  unsigned PWM4PHL7             : 1;
  } __PWM4PHLbits_t;

extern __at(0x0DC1) volatile __PWM4PHLbits_t PWM4PHLbits;

#define _PWM4PHL0               0x01
#define _PWM4PHL1               0x02
#define _PWM4PHL2               0x04
#define _PWM4PHL3               0x08
#define _PWM4PHL4               0x10
#define _PWM4PHL5               0x20
#define _PWM4PHL6               0x40
#define _PWM4PHL7               0x80

//==============================================================================


//==============================================================================
//        PWM4PHH Bits

extern __at(0x0DC2) __sfr PWM4PHH;

typedef struct
  {
  unsigned PWM4PHH0             : 1;
  unsigned PWM4PHH1             : 1;
  unsigned PWM4PHH2             : 1;
  unsigned PWM4PHH3             : 1;
  unsigned PWM4PHH4             : 1;
  unsigned PWM4PHH5             : 1;
  unsigned PWM4PHH6             : 1;
  unsigned PWM4PHH7             : 1;
  } __PWM4PHHbits_t;

extern __at(0x0DC2) volatile __PWM4PHHbits_t PWM4PHHbits;

#define _PWM4PHH0               0x01
#define _PWM4PHH1               0x02
#define _PWM4PHH2               0x04
#define _PWM4PHH3               0x08
#define _PWM4PHH4               0x10
#define _PWM4PHH5               0x20
#define _PWM4PHH6               0x40
#define _PWM4PHH7               0x80

//==============================================================================

extern __at(0x0DC3) __sfr PWM4DC;

//==============================================================================
//        PWM4DCL Bits

extern __at(0x0DC3) __sfr PWM4DCL;

typedef struct
  {
  unsigned PWM4DCL0             : 1;
  unsigned PWM4DCL1             : 1;
  unsigned PWM4DCL2             : 1;
  unsigned PWM4DCL3             : 1;
  unsigned PWM4DCL4             : 1;
  unsigned PWM4DCL5             : 1;
  unsigned PWM4DCL6             : 1;
  unsigned PWM4DCL7             : 1;
  } __PWM4DCLbits_t;

extern __at(0x0DC3) volatile __PWM4DCLbits_t PWM4DCLbits;

#define _PWM4DCL0               0x01
#define _PWM4DCL1               0x02
#define _PWM4DCL2               0x04
#define _PWM4DCL3               0x08
#define _PWM4DCL4               0x10
#define _PWM4DCL5               0x20
#define _PWM4DCL6               0x40
#define _PWM4DCL7               0x80

//==============================================================================


//==============================================================================
//        PWM4DCH Bits

extern __at(0x0DC4) __sfr PWM4DCH;

typedef struct
  {
  unsigned PWM4DCH0             : 1;
  unsigned PWM4DCH1             : 1;
  unsigned PWM4DCH2             : 1;
  unsigned PWM4DCH3             : 1;
  unsigned PWM4DCH4             : 1;
  unsigned PWM4DCH5             : 1;
  unsigned PWM4DCH6             : 1;
  unsigned PWM4DCH7             : 1;
  } __PWM4DCHbits_t;

extern __at(0x0DC4) volatile __PWM4DCHbits_t PWM4DCHbits;

#define _PWM4DCH0               0x01
#define _PWM4DCH1               0x02
#define _PWM4DCH2               0x04
#define _PWM4DCH3               0x08
#define _PWM4DCH4               0x10
#define _PWM4DCH5               0x20
#define _PWM4DCH6               0x40
#define _PWM4DCH7               0x80

//==============================================================================

extern __at(0x0DC5) __sfr PWM4PR;

//==============================================================================
//        PWM4PRL Bits

extern __at(0x0DC5) __sfr PWM4PRL;

typedef struct
  {
  unsigned PWM4PRL0             : 1;
  unsigned PWM4PRL1             : 1;
  unsigned PWM4PRL2             : 1;
  unsigned PWM4PRL3             : 1;
  unsigned PWM4PRL4             : 1;
  unsigned PWM4PRL5             : 1;
  unsigned PWM4PRL6             : 1;
  unsigned PWM4PRL7             : 1;
  } __PWM4PRLbits_t;

extern __at(0x0DC5) volatile __PWM4PRLbits_t PWM4PRLbits;

#define _PWM4PRL0               0x01
#define _PWM4PRL1               0x02
#define _PWM4PRL2               0x04
#define _PWM4PRL3               0x08
#define _PWM4PRL4               0x10
#define _PWM4PRL5               0x20
#define _PWM4PRL6               0x40
#define _PWM4PRL7               0x80

//==============================================================================


//==============================================================================
//        PWM4PRH Bits

extern __at(0x0DC6) __sfr PWM4PRH;

typedef struct
  {
  unsigned PWM4PRH0             : 1;
  unsigned PWM4PRH1             : 1;
  unsigned PWM4PRH2             : 1;
  unsigned PWM4PRH3             : 1;
  unsigned PWM4PRH4             : 1;
  unsigned PWM4PRH5             : 1;
  unsigned PWM4PRH6             : 1;
  unsigned PWM4PRH7             : 1;
  } __PWM4PRHbits_t;

extern __at(0x0DC6) volatile __PWM4PRHbits_t PWM4PRHbits;

#define _PWM4PRH0               0x01
#define _PWM4PRH1               0x02
#define _PWM4PRH2               0x04
#define _PWM4PRH3               0x08
#define _PWM4PRH4               0x10
#define _PWM4PRH5               0x20
#define _PWM4PRH6               0x40
#define _PWM4PRH7               0x80

//==============================================================================

extern __at(0x0DC7) __sfr PWM4OF;

//==============================================================================
//        PWM4OFL Bits

extern __at(0x0DC7) __sfr PWM4OFL;

typedef struct
  {
  unsigned PWM4OFL0             : 1;
  unsigned PWM4OFL1             : 1;
  unsigned PWM4OFL2             : 1;
  unsigned PWM4OFL3             : 1;
  unsigned PWM4OFL4             : 1;
  unsigned PWM4OFL5             : 1;
  unsigned PWM4OFL6             : 1;
  unsigned PWM4OFL7             : 1;
  } __PWM4OFLbits_t;

extern __at(0x0DC7) volatile __PWM4OFLbits_t PWM4OFLbits;

#define _PWM4OFL0               0x01
#define _PWM4OFL1               0x02
#define _PWM4OFL2               0x04
#define _PWM4OFL3               0x08
#define _PWM4OFL4               0x10
#define _PWM4OFL5               0x20
#define _PWM4OFL6               0x40
#define _PWM4OFL7               0x80

//==============================================================================


//==============================================================================
//        PWM4OFH Bits

extern __at(0x0DC8) __sfr PWM4OFH;

typedef struct
  {
  unsigned PWM4OFH0             : 1;
  unsigned PWM4OFH1             : 1;
  unsigned PWM4OFH2             : 1;
  unsigned PWM4OFH3             : 1;
  unsigned PWM4OFH4             : 1;
  unsigned PWM4OFH5             : 1;
  unsigned PWM4OFH6             : 1;
  unsigned PWM4OFH7             : 1;
  } __PWM4OFHbits_t;

