OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1579.h
#define SCS0                    OSCCONbits.SCS0                 // bit 0
#define SCS1                    OSCCONbits.SCS1                 // bit 1
#define IRCF0                   OSCCONbits.IRCF0                // bit 3
#define IRCF1                   OSCCONbits.IRCF1                // bit 4
#define IRCF2                   OSCCONbits.IRCF2                // bit 5
#define IRCF3                   OSCCONbits.IRCF3                // bit 6
#define SPLLEN                  OSCCONbits.SPLLEN               // bit 7

#define HFIOFS                  OSCSTATbits.HFIOFS              // bit 0
#define LFIOFR                  OSCSTATbits.LFIOFR              // bit 1
#define MFIOFR                  OSCSTATbits.MFIOFR              // bit 2
#define HFIOFL                  OSCSTATbits.HFIOFL              // bit 3
#define HFIOFR                  OSCSTATbits.HFIOFR              // bit 4
#define OSTS                    OSCSTATbits.OSTS                // bit 5
#define PLLR                    OSCSTATbits.PLLR                // bit 6

#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4
#define TUN5                    OSCTUNEbits.TUN5                // bit 5

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define NOT_RI                  PCONbits.NOT_RI                 // bit 2
#define NOT_RMCLR               PCONbits.NOT_RMCLR              // bit 3
#define NOT_RWDT                PCONbits.NOT_RWDT               // bit 4
#define STKUNF                  PCONbits.STKUNF                 // bit 6
#define STKOVF                  PCONbits.STKOVF                 // bit 7

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define TMR1GIE                 PIE1bits.TMR1GIE                // bit 7

#define C1IE                    PIE2bits.C1IE                   // bit 5
#define C2IE                    PIE2bits.C2IE                   // bit 6

#define PWM1IE                  PIE3bits.PWM1IE                 // bit 4
#define PWM2IE                  PIE3bits.PWM2IE                 // bit 5
#define PWM3IE                  PIE3bits.PWM3IE                 // bit 6
#define PWM4IE                  PIE3bits.PWM4IE                 // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define TXIF                    PIR1bits.TXIF                   // bit 4
#define RCIF                    PIR1bits.RCIF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define TMR1GIF                 PIR1bits.TMR1GIF                // bit 7

#define C1IF                    PIR2bits.C1IF                   // bit 5
#define C2IF                    PIR2bits.C2IF                   // bit 6

#define PWM1IF                  PIR3bits.PWM1IF                 // bit 4
#define PWM2IF                  PIR3bits.PWM2IF                 // bit 5
#define PWM3IF                  PIR3bits.PWM3IF                 // bit 6
#define PWM4IF                  PIR3bits.PWM4IF                 // bit 7

#define RD                      PMCON1bits.RD                   // bit 0
#define WR                      PMCON1bits.WR                   // bit 1
#define WREN                    PMCON1bits.WREN                 // bit 2
#define WRERR                   PMCON1bits.WRERR                // bit 3
#define FREE                    PMCON1bits.FREE                 // bit 4
#define LWLO                    PMCON1bits.LWLO                 // bit 5
#define CFGS                    PMCON1bits.CFGS                 // bit 6

#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5

#define RB4                     PORTBbits.RB4                   // bit 4
#define RB5                     PORTBbits.RB5                   // bit 5
#define RB6                     PORTBbits.RB6                   // bit 6
#define RB7                     PORTBbits.RB7                   // bit 7

#define RC0                     PORTCbits.RC0                   // bit 0
#define RC1                     PORTCbits.RC1                   // bit 1
#define RC2                     PORTCbits.RC2                   // bit 2
#define RC3                     PORTCbits.RC3                   // bit 3
#define RC4                     PORTCbits.RC4                   // bit 4
#define RC5                     PORTCbits.RC5                   // bit 5
#define RC6                     PORTCbits.RC6                   // bit 6
#define RC7                     PORTCbits.RC7                   // bit 7

#define PPSLOCKED               PPSLOCKbits.PPSLOCKED           // bit 0

#define PWM1MODE0               PWM1CONbits.PWM1MODE0           // bit 2, shadows bit in PWM1CONbits
#define MODE0                   PWM1CONbits.MODE0               // bit 2, shadows bit in PWM1CONbits
#define PWM1MODE1               PWM1CONbits.PWM1MODE1           // bit 3, shadows bit in PWM1CONbits
#define MODE1                   PWM1CONbits.MODE1               // bit 3, shadows bit in PWM1CONbits
#define POL                     PWM1CONbits.POL                 // bit 4, shadows bit in PWM1CONbits
#define PWM1POL                 PWM1CONbits.PWM1POL             // bit 4, shadows bit in PWM1CONbits
#define OUT                     PWM1CONbits.OUT                 // bit 5, shadows bit in PWM1CONbits
#define PWM1OUT                 PWM1CONbits.PWM1OUT             // bit 5, shadows bit in PWM1CONbits
#define OE                      PWM1CONbits.OE                  // bit 6, shadows bit in PWM1CONbits
#define PWM1OE                  PWM1CONbits.PWM1OE              // bit 6, shadows bit in PWM1CONbits
#define EN                      PWM1CONbits.EN                  // bit 7, shadows bit in PWM1CONbits
#define PWM1EN                  PWM1CONbits.PWM1EN              // bit 7, shadows bit in PWM1CONbits

#define PWM1DCH0                PWM1DCHbits.PWM1DCH0            // bit 0
#define PWM1DCH1                PWM1DCHbits.PWM1DCH1            // bit 1
#define PWM1DCH2                PWM1DCHbits.PWM1DCH2            // bit 2
#define PWM1DCH3                PWM1DCHbits.PWM1DCH3            // bit 3
#define PWM1DCH4                PWM1DCHbits.PWM1DCH4            // bit 4
#define PWM1DCH5                PWM1DCHbits.PWM1DCH5            // bit 5
#define PWM1DCH6                PWM1DCHbits.PWM1DCH6            // bit 6
#define PWM1DCH7                PWM1DCHbits.PWM1DCH7            // bit 7

#define PWM1DCL0                PWM1DCLbits.PWM1DCL0            // bit 0
#define PWM1DCL1                PWM1DCLbits.PWM1DCL1            // bit 1
#define PWM1DCL2                PWM1DCLbits.PWM1DCL2            // bit 2
#define PWM1DCL3                PWM1DCLbits.PWM1DCL3            // bit 3
#define PWM1DCL4                PWM1DCLbits.PWM1DCL4            // bit 4
#define PWM1DCL5                PWM1DCLbits.PWM1DCL5            // bit 5
#define PWM1DCL6                PWM1DCLbits.PWM1DCL6            // bit 6
#define PWM1DCL7                PWM1DCLbits.PWM1DCL7            // bit 7

#define PRIE                    PWM1INTCONbits.PRIE             // bit 0, shadows bit in PWM1INTCONbits
#define PWM1PRIE                PWM1INTCONbits.PWM1PRIE         // bit 0, shadows bit in PWM1INTCONbits
#define DCIE                    PWM1INTCONbits.DCIE             // bit 1, shadows bit in PWM1INTCONbits
#define PWM1DCIE                PWM1INTCONbits.PWM1DCIE         // bit 1, shadows bit in PWM1INTCONbits
#define PHIE                    PWM1INTCONbits.PHIE             // bit 2, shadows bit in PWM1INTCONbits
#define PWM1PHIE                PWM1INTCONbits.PWM1PHIE         // bit 2, shadows bit in PWM1INTCONbits
#define OFIE                    PWM1INTCONbits.OFIE             // bit 3, shadows bit in PWM1INTCONbits
#define PWM1OFIE                PWM1INTCONbits.PWM1OFIE         // bit 3, shadows bit in PWM1INTCONbits

#define PRIF                    PWM1INTFbits.PRIF               // bit 0, shadows bit in PWM1INTFbits
#define PWM1PRIF                PWM1INTFbits.PWM1PRIF           // bit 0, shadows bit in PWM1INTFbits
#define DCIF                    PWM1INTFbits.DCIF               // bit 1, shadows bit in PWM1INTFbits
#define PWM1DCIF                PWM1INTFbits.PWM1DCIF           // bit 1, shadows bit in PWM1INTFbits
#define PHIF                    PWM1INTFbits.PHIF               // bit 2, shadows bit in PWM1INTFbits
#define PWM1PHIF                PWM1INTFbits.PWM1PHIF           // bit 2, shadows bit in PWM1INTFbits
#define OFIF                    PWM1INTFbits.OFIF               // bit 3, shadows bit in PWM1INTFbits
#define PWM1OFIF                PWM1INTFbits.PWM1OFIF           // bit 3, shadows bit in PWM1INTFbits

