OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1579.h
#define PWM3OFL0                PWM3OFLbits.PWM3OFL0            // bit 0
#define PWM3OFL1                PWM3OFLbits.PWM3OFL1            // bit 1
#define PWM3OFL2                PWM3OFLbits.PWM3OFL2            // bit 2
#define PWM3OFL3                PWM3OFLbits.PWM3OFL3            // bit 3
#define PWM3OFL4                PWM3OFLbits.PWM3OFL4            // bit 4
#define PWM3OFL5                PWM3OFLbits.PWM3OFL5            // bit 5
#define PWM3OFL6                PWM3OFLbits.PWM3OFL6            // bit 6
#define PWM3OFL7                PWM3OFLbits.PWM3OFL7            // bit 7

#define PWM3PHH0                PWM3PHHbits.PWM3PHH0            // bit 0
#define PWM3PHH1                PWM3PHHbits.PWM3PHH1            // bit 1
#define PWM3PHH2                PWM3PHHbits.PWM3PHH2            // bit 2
#define PWM3PHH3                PWM3PHHbits.PWM3PHH3            // bit 3
#define PWM3PHH4                PWM3PHHbits.PWM3PHH4            // bit 4
#define PWM3PHH5                PWM3PHHbits.PWM3PHH5            // bit 5
#define PWM3PHH6                PWM3PHHbits.PWM3PHH6            // bit 6
#define PWM3PHH7                PWM3PHHbits.PWM3PHH7            // bit 7

#define PWM3PHL0                PWM3PHLbits.PWM3PHL0            // bit 0
#define PWM3PHL1                PWM3PHLbits.PWM3PHL1            // bit 1
#define PWM3PHL2                PWM3PHLbits.PWM3PHL2            // bit 2
#define PWM3PHL3                PWM3PHLbits.PWM3PHL3            // bit 3
#define PWM3PHL4                PWM3PHLbits.PWM3PHL4            // bit 4
#define PWM3PHL5                PWM3PHLbits.PWM3PHL5            // bit 5
#define PWM3PHL6                PWM3PHLbits.PWM3PHL6            // bit 6
#define PWM3PHL7                PWM3PHLbits.PWM3PHL7            // bit 7

#define PWM3PRH0                PWM3PRHbits.PWM3PRH0            // bit 0
#define PWM3PRH1                PWM3PRHbits.PWM3PRH1            // bit 1
#define PWM3PRH2                PWM3PRHbits.PWM3PRH2            // bit 2
#define PWM3PRH3                PWM3PRHbits.PWM3PRH3            // bit 3
#define PWM3PRH4                PWM3PRHbits.PWM3PRH4            // bit 4
#define PWM3PRH5                PWM3PRHbits.PWM3PRH5            // bit 5
#define PWM3PRH6                PWM3PRHbits.PWM3PRH6            // bit 6
#define PWM3PRH7                PWM3PRHbits.PWM3PRH7            // bit 7

#define PWM3PRL0                PWM3PRLbits.PWM3PRL0            // bit 0
#define PWM3PRL1                PWM3PRLbits.PWM3PRL1            // bit 1
#define PWM3PRL2                PWM3PRLbits.PWM3PRL2            // bit 2
#define PWM3PRL3                PWM3PRLbits.PWM3PRL3            // bit 3
#define PWM3PRL4                PWM3PRLbits.PWM3PRL4            // bit 4
#define PWM3PRL5                PWM3PRLbits.PWM3PRL5            // bit 5
#define PWM3PRL6                PWM3PRLbits.PWM3PRL6            // bit 6
#define PWM3PRL7                PWM3PRLbits.PWM3PRL7            // bit 7

#define PWM3TMRH0               PWM3TMRHbits.PWM3TMRH0          // bit 0
#define PWM3TMRH1               PWM3TMRHbits.PWM3TMRH1          // bit 1
#define PWM3TMRH2               PWM3TMRHbits.PWM3TMRH2          // bit 2
#define PWM3TMRH3               PWM3TMRHbits.PWM3TMRH3          // bit 3
#define PWM3TMRH4               PWM3TMRHbits.PWM3TMRH4          // bit 4
#define PWM3TMRH5               PWM3TMRHbits.PWM3TMRH5          // bit 5
#define PWM3TMRH6               PWM3TMRHbits.PWM3TMRH6          // bit 6
#define PWM3TMRH7               PWM3TMRHbits.PWM3TMRH7          // bit 7

#define PWM3TMRL0               PWM3TMRLbits.PWM3TMRL0          // bit 0
#define PWM3TMRL1               PWM3TMRLbits.PWM3TMRL1          // bit 1
#define PWM3TMRL2               PWM3TMRLbits.PWM3TMRL2          // bit 2
#define PWM3TMRL3               PWM3TMRLbits.PWM3TMRL3          // bit 3
#define PWM3TMRL4               PWM3TMRLbits.PWM3TMRL4          // bit 4
#define PWM3TMRL5               PWM3TMRLbits.PWM3TMRL5          // bit 5
#define PWM3TMRL6               PWM3TMRLbits.PWM3TMRL6          // bit 6
#define PWM3TMRL7               PWM3TMRLbits.PWM3TMRL7          // bit 7

#define PWM4DCH0                PWM4DCHbits.PWM4DCH0            // bit 0
#define PWM4DCH1                PWM4DCHbits.PWM4DCH1            // bit 1
#define PWM4DCH2                PWM4DCHbits.PWM4DCH2            // bit 2
#define PWM4DCH3                PWM4DCHbits.PWM4DCH3            // bit 3
#define PWM4DCH4                PWM4DCHbits.PWM4DCH4            // bit 4
#define PWM4DCH5                PWM4DCHbits.PWM4DCH5            // bit 5
#define PWM4DCH6                PWM4DCHbits.PWM4DCH6            // bit 6
#define PWM4DCH7                PWM4DCHbits.PWM4DCH7            // bit 7

#define PWM4DCL0                PWM4DCLbits.PWM4DCL0            // bit 0
#define PWM4DCL1                PWM4DCLbits.PWM4DCL1            // bit 1
#define PWM4DCL2                PWM4DCLbits.PWM4DCL2            // bit 2
#define PWM4DCL3                PWM4DCLbits.PWM4DCL3            // bit 3
#define PWM4DCL4                PWM4DCLbits.PWM4DCL4            // bit 4
#define PWM4DCL5                PWM4DCLbits.PWM4DCL5            // bit 5
#define PWM4DCL6                PWM4DCLbits.PWM4DCL6            // bit 6
#define PWM4DCL7                PWM4DCLbits.PWM4DCL7            // bit 7

#define PWM4OFH0                PWM4OFHbits.PWM4OFH0            // bit 0
#define PWM4OFH1                PWM4OFHbits.PWM4OFH1            // bit 1
#define PWM4OFH2                PWM4OFHbits.PWM4OFH2            // bit 2
#define PWM4OFH3                PWM4OFHbits.PWM4OFH3            // bit 3
#define PWM4OFH4                PWM4OFHbits.PWM4OFH4            // bit 4
#define PWM4OFH5                PWM4OFHbits.PWM4OFH5            // bit 5
#define PWM4OFH6                PWM4OFHbits.PWM4OFH6            // bit 6
#define PWM4OFH7                PWM4OFHbits.PWM4OFH7            // bit 7

#define PWM4OFL0                PWM4OFLbits.PWM4OFL0            // bit 0
#define PWM4OFL1                PWM4OFLbits.PWM4OFL1            // bit 1
#define PWM4OFL2                PWM4OFLbits.PWM4OFL2            // bit 2
#define PWM4OFL3                PWM4OFLbits.PWM4OFL3            // bit 3
#define PWM4OFL4                PWM4OFLbits.PWM4OFL4            // bit 4
#define PWM4OFL5                PWM4OFLbits.PWM4OFL5            // bit 5
#define PWM4OFL6                PWM4OFLbits.PWM4OFL6            // bit 6
#define PWM4OFL7                PWM4OFLbits.PWM4OFL7            // bit 7

#define PWM4PHH0                PWM4PHHbits.PWM4PHH0            // bit 0
#define PWM4PHH1                PWM4PHHbits.PWM4PHH1            // bit 1
#define PWM4PHH2                PWM4PHHbits.PWM4PHH2            // bit 2
#define PWM4PHH3                PWM4PHHbits.PWM4PHH3            // bit 3
#define PWM4PHH4                PWM4PHHbits.PWM4PHH4            // bit 4
#define PWM4PHH5                PWM4PHHbits.PWM4PHH5            // bit 5
#define PWM4PHH6                PWM4PHHbits.PWM4PHH6            // bit 6
#define PWM4PHH7                PWM4PHHbits.PWM4PHH7            // bit 7

#define PWM4PHL0                PWM4PHLbits.PWM4PHL0            // bit 0
#define PWM4PHL1                PWM4PHLbits.PWM4PHL1            // bit 1
#define PWM4PHL2                PWM4PHLbits.PWM4PHL2            // bit 2
#define PWM4PHL3                PWM4PHLbits.PWM4PHL3            // bit 3
#define PWM4PHL4                PWM4PHLbits.PWM4PHL4            // bit 4
#define PWM4PHL5                PWM4PHLbits.PWM4PHL5            // bit 5
#define PWM4PHL6                PWM4PHLbits.PWM4PHL6            // bit 6
#define PWM4PHL7                PWM4PHLbits.PWM4PHL7            // bit 7

#define PWM4PRH0                PWM4PRHbits.PWM4PRH0            // bit 0
#define PWM4PRH1                PWM4PRHbits.PWM4PRH1            // bit 1
#define PWM4PRH2                PWM4PRHbits.PWM4PRH2            // bit 2
#define PWM4PRH3                PWM4PRHbits.PWM4PRH3            // bit 3
#define PWM4PRH4                PWM4PRHbits.PWM4PRH4            // bit 4
#define PWM4PRH5                PWM4PRHbits.PWM4PRH5            // bit 5
#define PWM4PRH6                PWM4PRHbits.PWM4PRH6            // bit 6
#define PWM4PRH7                PWM4PRHbits.PWM4PRH7            // bit 7

#define PWM4PRL0                PWM4PRLbits.PWM4PRL0            // bit 0
#define PWM4PRL1                PWM4PRLbits.PWM4PRL1            // bit 1
#define PWM4PRL2                PWM4PRLbits.PWM4PRL2            // bit 2
#define PWM4PRL3                PWM4PRLbits.PWM4PRL3            // bit 3
#define PWM4PRL4                PWM4PRLbits.PWM4PRL4            // bit 4
#define PWM4PRL5                PWM4PRLbits.PWM4PRL5            // bit 5
#define PWM4PRL6                PWM4PRLbits.PWM4PRL6            // bit 6
#define PWM4PRL7                PWM4PRLbits.PWM4PRL7            // bit 7

#define PWM4TMRH0               PWM4TMRHbits.PWM4TMRH0          // bit 0
#define PWM4TMRH1               PWM4TMRHbits.PWM4TMRH1          // bit 1
#define PWM4TMRH2               PWM4TMRHbits.PWM4TMRH2          // bit 2
#define PWM4TMRH3               PWM4TMRHbits.PWM4TMRH3          // bit 3
#define PWM4TMRH4               PWM4TMRHbits.PWM4TMRH4          // bit 4
#define PWM4TMRH5               PWM4TMRHbits.PWM4TMRH5          // bit 5
#define PWM4TMRH6               PWM4TMRHbits.PWM4TMRH6          // bit 6
#define PWM4TMRH7               PWM4TMRHbits.PWM4TMRH7          // bit 7

#define PWM4TMRL0               PWM4TMRLbits.PWM4TMRL0          // bit 0
#define PWM4TMRL1               PWM4TMRLbits.PWM4TMRL1          // bit 1
#define PWM4TMRL2               PWM4TMRLbits.PWM4TMRL2          // bit 2
#define PWM4TMRL3               PWM4TMRLbits.PWM4TMRL3          // bit 3
#define PWM4TMRL4               PWM4TMRLbits.PWM4TMRL4          // bit 4
#define PWM4TMRL5               PWM4TMRLbits.PWM4TMRL5          // bit 5
#define PWM4TMRL6               PWM4TMRLbits.PWM4TMRL6          // bit 6
#define PWM4TMRL7               PWM4TMRLbits.PWM4TMRL7          // bit 7

